openFoam/flow_past_sphere/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type             freestream;
        freestreamValue  $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "sphere*"
    {
        type            fixedValue; 
        value           uniform (0 0 0); 
    }

    bndryWalls 
    {
        type            fixedValue;
        value           uniform (0 0 0); 
    }
}

// ************************************************************************* //
