openFoam/flow_past_sphere/Allrun
blockMesh 
snappyHexMesh
cp -r 3/polyMesh constant/
simpleFoam
