openFoam/flow_past_sphere/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices
(
(-5 0  0 )
(-5 0  10)
(-5 10 10)
(-5 10 0 )
(20 0  0 )
(20 0  10)
(20 10 10)
(20 10 0 )
);
blocks
(
hex (0 4 7 3 1 5 6 2) (20 10 10) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
inlet
 {
 type patch;
 faces
   (
   (0 1 2 3)
   );
 }
 bndryWalls
 {
   type wall;
   faces
    (
    (7 4 0 3)
    (5 6 2 1)
    (7 3 2 6)
    (4 5 1 0)
    );
 }
outlet
 {
   type patch;
   faces
   (
   (7 6 5 4)
   );
 }
);
mergePatchPairs
(
);

// ************************************************************************* //
